; domain
(define (domain drone-dom)

    (:requirements
        :typing
    )

    (:types
        drone human box content location - object
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry ?d - drone ?b - box)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
    )

    (:action move
        :parameters (?d - drone ?from ?to - location)
        :precondition (and 
            (drone-at ?d ?from)
        )
        :effect (and
            (drone-at ?d ?to) 
            (not (drone-at ?d ?from))
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r0_l7_p7_c7_g7_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
	human7 - human
)

(:init
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-at box7 warehouse)
	(box-free box7)
	(box-has box1 food)
	(box-has box2 meds)
	(box-has box3 meds)
	(box-has box4 meds)
	(box-has box5 meds)
	(box-has box6 meds)
	(box-has box7 meds)
	(human-at human1 loc7)
	(human-at human2 loc1)
	(human-at human3 loc3)
	(human-at human4 loc3)
	(human-at human5 loc5)
	(human-at human6 loc7)
	(human-at human7 loc4)
)

(:goal (and

	(drone-at drone1 warehouse)
	(human-has human1 food)
	(human-has human1 meds)
	(human-has human2 meds)
	(human-has human4 meds)
	(human-has human5 meds)
	(human-has human6 meds)
	(human-has human7 meds)
	))
)

; plan
1. (pick-up drone1 box3 meds warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry drone1 box3)
   goals met: 1 of 8
2. (move drone1 warehouse loc7)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc7)
   goals met: 0 of 8
3. (drop drone1 box3 meds loc7 human1)
   deleted: (drone-carry drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc7) (human-has human1 meds)
   goals met: 1 of 8
4. (move drone1 loc7 warehouse)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 warehouse)
   goals met: 2 of 8
5. (pick-up drone1 box6 meds warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry drone1 box6)
   goals met: 2 of 8
6. (move drone1 warehouse loc5)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 1 of 8
7. (drop drone1 box6 meds loc5 human5)
   deleted: (drone-carry drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc5) (human-has human5 meds)
   goals met: 2 of 8
8. (move drone1 loc5 warehouse)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 8
9. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry drone1 box1)
   goals met: 3 of 8
10. (move drone1 warehouse loc7)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc7)
   goals met: 2 of 8
11. (drop drone1 box1 food loc7 human1)
   deleted: (drone-carry drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc7) (human-has human1 food)
   goals met: 3 of 8
12. (move drone1 loc7 warehouse)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 8
13. (pick-up drone1 box5 meds warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry drone1 box5)
   goals met: 4 of 8
14. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 3 of 8
15. (drop drone1 box5 meds loc4 human7)
   deleted: (drone-carry drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc4) (human-has human7 meds)
   goals met: 4 of 8
16. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 8
17. (pick-up drone1 box4 meds warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry drone1 box4)
   goals met: 5 of 8
18. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 4 of 8
19. (drop drone1 box4 meds loc1 human2)
   deleted: (drone-carry drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc1) (human-has human2 meds)
   goals met: 5 of 8
20. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 8
21. (pick-up drone1 box7 meds warehouse)
   deleted: (drone-free drone1) (box-at box7 warehouse)
   added: (drone-carry drone1 box7)
   goals met: 6 of 8
22. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 5 of 8
23. (drop drone1 box7 meds loc3 human4)
   deleted: (drone-carry drone1 box7) (box-free box7)
   added: (drone-free drone1) (box-at box7 loc3) (human-has human4 meds)
   goals met: 6 of 8
24. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 8
25. (pick-up drone1 box2 meds warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry drone1 box2)
   goals met: 7 of 8
26. (move drone1 warehouse loc7)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc7)
   goals met: 6 of 8
27. (drop drone1 box2 meds loc7 human6)
   deleted: (drone-carry drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc7) (human-has human6 meds)
   goals met: 7 of 8
28. (move drone1 loc7 warehouse)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 8
